<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"1304bf322987c8fa3606f5ccb05292c036d17ab712dfc3c873d102f1052e0a6d","plan_job_ref":"Job Test actions using target and replace #440 at https://github.com/dflook/terraform-github-actions/actions/runs/12528867548","plan_out_hash":"bf714a9f78c4a4701362128c2bc9a32a0d262575c4f74c243c7a3d4772b0e466","plan_hash":"f5adde4377de24131f86292af6002a4e1a423023d09602114d40772bb7e95c9b","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
!~  count   = "9BrgYGE773" -> (known after apply)
!~  foreach = "l3doPKoOt1" -> (known after apply)
```
</details>

:memo: Plan generated in [Test actions using target and replace #440](https://github.com/dflook/terraform-github-actions/actions/runs/12528867548)